[{"title":"Autos Funny Cars/Funny Cars","authors":["Angie Peterson Kaelberer"],"publishedDate":"2006-07-15","maturityRating":"NOT_MATURE","description":"\"Discusses funny cars, including their main features and how they are raced.\"","pageCount":32,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=12hQDD398tIC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=12hQDD398tIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":4,"city":"Quito","type":"Hardcover"},{"title":"A Funny Dolch Word Book #1 Un Libro Cómico #1 de la Palabra de Dolch (Spanish - English)","authors":["Betsy B. Lee"],"publishedDate":"2006-07-01","maturityRating":"NOT_MATURE","imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=950TQk-t7JsC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=950TQk-t7JsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":5,"city":"Medellin","type":"Digital"},{"title":"El bebé raro / The Funny Baby","authors":["Margaret Hillert"],"publishedDate":"2017","maturityRating":"NOT_MATURE","description":"An easy to read fairy tale, in English and Spanish, about The Ugly Duckling who turns into a beautiful swan. Beginning-to-Read™ books foster independent reading and comprehension. Using high frequency words and repetition, readers gain confidence while enjoying classic fairy tale stories. Full-color and updated illustrations included. Reading reinforcement activities and a note to caregivers are included. Activities focus on foundational, language and reading skills. Perfect for an early introduction to Spanish or for ESL.","pageCount":32,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=hp45DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=hp45DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":3,"city":"Cartagena","type":"Hardcover"},{"title":"I Funny","authors":["James Patterson"],"publishedDate":"2012-12-06","maturityRating":"NOT_MATURE","description":"Jamie Grimm is a middle schooler on a mission: he wants to become the world's greatest stand-up comedian - even if he always seems to 'choke' in the spotlight. When Jamie finds out about a contest called the Funniest Kid on the Planet, he knows it's time to face his fears and enter. But are the judges rewarding him out of pity because he happens to be in a wheelchair, like his bullying cousin Stevie suggests? And will Jamie ever share the secret of his troubled past - and reason for his disability - instead of hiding behind his comedy act? In this highly illustrated book that's as heartfelt as it is hilarious, James Patterson dishes out heaps of jokes that will have readers rolling on the floor and cheering for more.","pageCount":336,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=so3W98dP3EUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=so3W98dP3EUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":4,"stars":2,"city":"Medellin","type":"Digital"},{"title":"Los Fantasmas Chistosos / The Funny Ghosts","authors":["Thomas Armond Sonny Rist"],"maturityRating":"NOT_MATURE","imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=TQFVBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=TQFVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":1,"city":"Quito","type":"Digital"},{"title":"¡Primer día de clases! (A Funny First Day)","authors":["Catherine C. Mangieri"],"publishedDate":"2006-08-01","maturityRating":"NOT_MATURE","description":"1 copy","pageCount":12,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=T6C7ppUWy_sC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=T6C7ppUWy_sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":3,"city":"Cartagena","type":"Hardcover"},{"title":"Something Funny Happened at the Library","authors":["Rob Reid"],"publishedDate":"2003","maturityRating":"NOT_MATURE","description":"This is how storyteller, librarian, and all-around jokester Rob Reid opens his delightful new book, Something Funny Happened at the Library. Wouldn't it be great if kids came home from the library holding their sides, eager to pass on the funny things they heard in the library that day? According to Reid, the best way to get the attention of young people is to make them laugh. From easy-to-win-over preschoolers to unimpressed teens, this book will serve as your personal humor coach for even the toughest audiences out there. With tricks of the trade on how to warm up an audience, choose age-appropriate material, use facial and vocal expressions to lure them in, and select props, you're on your way to something very funny! Young children won't be able to hold in their giggles after such programs as \"The World's Worst Ice-Cream Story,\" and intermediate school-age kids will love to take part in book theme parties in honor of Captain Underpants or such special celebrations as \"Boo Ha-Ha!\" Even those middle- and high-school students, once convinced to participate in \"Comedy Club\" (a program that combines reading and stand-up) or spoonerisms (a wordplay game), will be rolling in the aisles. To enrich all of these programs, Reid also includes a funny reader's theater script, tips on how to host lively library tours and school visits, and even rap songs that extol the virtues of reading and the library! A complete resource for getting children and young adults snickering and having fun in the stacks with innovative programming that uses humor, Something Funny helps you to connect with children and young adults and, along the way, make the library the hippest place in town!","pageCount":163,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=aFkVv3pStR4C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=aFkVv3pStR4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":2,"stars":4,"city":"Cartagena","type":"Digital"},{"title":"Funny","authors":["Eilidh & Malcolm McDonough"],"maturityRating":"NOT_MATURE","imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Y0koAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Y0koAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":2,"city":"Medellin","type":"Hardcover"},{"title":"How to Be Funny","authors":["Jon Macks"],"publishedDate":"2010-06-15","maturityRating":"NOT_MATURE","description":"An invaluable guide on how to \"lighten up\" from a distinguished pro who has provided laughs for JAY LENO, BILLY CRYSTAL, STEVE MARTIN, ROBIN WILLIAMS, BRAD GARRETT, WHOOPI GOLDBERG, AND MANY MORE. Who hasn't wished for the perfect withering comeback line, a clever tension-breaking quip, or a winning flirtatious remark? Being funny is hard work and not everyone is a natural. How to Be Funny is a witty guide that teaches readers precisely how to be funnier in everyday life. It's a must-read for anyone who has to speak in public, be engaging and funny at work or at play, or who hopes to one day go out on a date. Jon Macks, a comedy writer for The Tonight Show with Jay Leno, the Academy Awards, the Emmy Awards, Hollywood Squares, and the nation's top comedians, politicians, and corporate leaders, knows his funny business. Here he demystifies the process of making people laugh, breaks down the basic building blocks and types of humor -- which include self-deprecation, misdirection, deadpan delivery, sarcasm, and \"the reverse\" -- and reveals the best approaches to use in common situations. How to Be Funny features helpful (and hilarious) tips and anecdotes from the comic legends Mack's worked with -- including Jay Leno, Arsenio Hall, Gilbert Gottfried, Billy Crystal, Rita Rudner, Dave Barry, and Carrie Fisher -- in his eleven years as one of the nation's top television writers. Whether the goal is to give a memorable public address or deliver a killer line with friends, How to Be Funny is a charming, instructive, and practical read.","pageCount":192,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=qyeTEmx7ZWQC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=qyeTEmx7ZWQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":1,"stars":1,"city":"Quito","type":"Digital"},{"title":"Acting Funny","authors":["Frances N. Teague"],"publishedDate":"1994","maturityRating":"NOT_MATURE","description":"Finally, these assumptions lead to the corollary that such hierarchies are natural and immutable and not fashioned by critics.","pageCount":190,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=BzRfkR51i60C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=BzRfkR51i60C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":5,"city":"Quito","type":"Hardcover"},{"title":"What's So Funny?","authors":["Nancy A. Walker"],"publishedDate":"1998-01-01","maturityRating":"NOT_MATURE","description":"Presents studies attempting to define and dissect American humor for students and scholars.","pageCount":284,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=kFvL_OVc0PUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=kFvL_OVc0PUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":3,"city":"Medellin","type":"Hardcover"},{"title":"A Funny Thing Happened on the Way Through My Bible Study","authors":["Bruce T. Morris"],"publishedDate":"2008-05","maturityRating":"NOT_MATURE","description":"Have you felt failure in forgiving? Do you know how your justices and legislators should be acting upon critical decisions affecting the family? Does your marriage need a boost? Or, even your divorce? Would you like to know more about how to please God and support your friends in marital status? Have other authors avoided the controversial issues from the Bible? Perhaps you need a little help identifying and using your spiritual gift. Do a few passages of Scripture completely baffle you? Mr. Morris' walk through his Bible studies will surely help you in one or more of your challenges. Why not take your \"walk\" with him? Mr. Morris was saved as a 7-year-old. He felt the call to preach as an 11-year-old. He became a pretty serious Bible student right after salvation, and felt that desire grow for years. He graduated from Hardin-Simmons University, Abilene, TX, with a major in Bible. He then spent most of his elective credits in pursuit of the New Testament as he earned a Master of Divinity at Southwestern Baptist Theological Seminary, Fort Worth, TX. He served 27 months in the US Army. He retired from the pastorate after 1-1/3 years as assistant to the pastor and almost 29 years as senior pastor of four other churches. Whether in school, in pastoral ministry, in secular work, or in retirement, Bible reading and Bible study remain an important part of his life. He lives in retirement in Abilene, Texas, with his wife of 52 years, Betty Martin Morris. They have three children, seven grandchildren, and three great grandchildren. Among other pursuits, he is at work on his second book, a Commentary on Romans and his next book on additional Biblical issues.","pageCount":184,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Z0QeLSM9-CEC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Z0QeLSM9-CEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":4,"city":"Cartagena","type":"Digital"},{"title":"Funny in Farsi","authors":["Firoozeh Dumas"],"publishedDate":"2007-12-18","maturityRating":"NOT_MATURE","description":"NEW YORK TIMES BESTSELLER • Finalist for the PEN/USA Award in Creative Nonfiction, the Thurber Prize for American Humor, and the Audie Award in Biography/Memoir This Random House Reader’s Circle edition includes a reading group guide and a conversation between Firoozeh Dumas and Khaled Hosseini, author of The Kite Runner! “Remarkable . . . told with wry humor shorn of sentimentality . . . In the end, what sticks with the reader is an exuberant immigrant embrace of America.”—San Francisco Chronicle In 1972, when she was seven, Firoozeh Dumas and her family moved from Iran to Southern California, arriving with no firsthand knowledge of this country beyond her father’s glowing memories of his graduate school years here. More family soon followed, and the clan has been here ever since. Funny in Farsi chronicles the American journey of Dumas’s wonderfully engaging family: her engineer father, a sweetly quixotic dreamer who first sought riches on Bowling for Dollars and in Las Vegas, and later lost his job during the Iranian revolution; her elegant mother, who never fully mastered English (nor cared to); her uncle, who combated the effects of American fast food with an army of miraculous American weight-loss gadgets; and Firoozeh herself, who as a girl changed her name to Julie, and who encountered a second wave of culture shock when she met and married a Frenchman, becoming part of a one-couple melting pot. In a series of deftly drawn scenes, we watch the family grapple with American English (hot dogs and hush puppies?—a complete mystery), American traditions (Thanksgiving turkey?—an even greater mystery, since it tastes like nothing), and American culture (Firoozeh’s parents laugh uproariously at Bob Hope on television, although they don’t get the jokes even when she translates them into Farsi). Above all, this is an unforgettable story of identity, discovery, and the power of family love. It is a book that will leave us all laughing—without an accent. Praise for Funny in Farsi “Heartfelt and hilarious—in any language.”—Glamour “A joyful success.”—Newsday “What’s charming beyond the humor of this memoir is that it remains affectionate even in the weakest, most tenuous moments for the culture. It’s the brilliance of true sophistication at work.”—Los Angeles Times Book Review “Often hilarious, always interesting . . . Like the movie My Big Fat Greek Wedding, this book describes with humor the intersection and overlapping of two cultures.”—The Providence Journal “A humorous and introspective chronicle of a life filled with love—of family, country, and heritage.”—Jimmy Carter “Delightfully refreshing.”—Milwaukee Journal Sentinel “[Funny in Farsi] brings us closer to discovering what it means to be an American.”—San Jose Mercury News From the Trade Paperback edition.","pageCount":224,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=cYZ_MRMaHGMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=cYZ_MRMaHGMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":3.5,"stars":5,"city":"Quito","type":"Hardcover"},{"title":"Funny Frames","authors":["Oliver C. Speck"],"publishedDate":"2010-06-03","maturityRating":"NOT_MATURE","description":"An incisive and wide-ranging study of Michael Haneke's entire body of work, broadening the scholarship on this highly controversial filmmaker.","pageCount":260,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=yD908Ajc2DgC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=yD908Ajc2DgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":2,"city":"Medellin","type":"Digital"},{"title":"Funny Bone","authors":["Christopher Stitt"],"publishedDate":"2000","maturityRating":"NOT_MATURE","description":"Humorous fiction. Texts include mystery, fantasy and recount. Explore frienship and common childhood themes, such as bullying. Includes a multicultural cast of characters.","pageCount":46,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=LnjAGGrLWIMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=LnjAGGrLWIMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":1,"city":"Cartagena","type":"Hardcover"},{"title":"Funny Things, Computers","authors":["Trevor Hutchings"],"publishedDate":"1983","maturityRating":"NOT_MATURE","description":"Funny Things, Computers offers a humourous visual examination of the early days of the personal computer, when technology invaded everyday life in innumerable, often hilarious, ways. You can love them, you can hate them - but you certainly can't ignore them. Computers in the home, computers on the job, computers that we're plugged into every time we bank, shop or travel - they all have their little quirks and ironies that Hutchings captures perfectly. In Funny Things, Computers, Trevor Hutchings' unique sense of humour is directed at that wondrous invention that is at once man's greatest achievement, nemesis and alter ego.","pageCount":80,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=UuNLhTrxgZkC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=UuNLhTrxgZkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":4,"city":"Medellin","type":"Digital"},{"title":"Funny Cryptograms","authors":["Shawn Kennedy"],"publishedDate":"2003","maturityRating":"NOT_MATURE","description":"More than 400 brain-jogging puzzles offer a crash course in cryptography, while the messages reward you with the comedy of Jay Leno, Elayne Boosler, and Jerry Seinfeld, as well as the wit and wisdom of Hillary Clinton, Stephen King, and Edna St. Vincent Millay. Solve each one on your own, or follow the tips for faster results. There's also a chart of hints for each puzzle.","pageCount":96,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=miYnWVlH8OUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=miYnWVlH8OUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":5,"city":"Cartagena","type":"Hardcover"},{"title":"Dangerously Funny","authors":["David Bianculli"],"publishedDate":"2009-12-01","maturityRating":"NOT_MATURE","description":"An unprecedented behind-the-scenes look at the rise and fall of The Smothers Brothers Comedy Hour -- the provocative, politically charged program that shocked the censors, outraged the White House, and forever changed the face of television. Decades before The Daily Show, The Smothers Brothers Comedy Hour proved there was a place on television for no-holds-barred political comedy with a decidedly antiauthoritarian point of view. In this first-ever all-access history of the show, veteran entertainment journalist David Bianculli tells the fascinating story of its three-year network run -- and the cultural impact that's still being felt today. Before it was suddenly removed from the CBS lineup (reportedly under pressure from the Nixon administration), The Smothers Brothers Comedy Hour was a ratings powerhouse. It helped launch the careers of comedy legends such as Steve Martin and Rob Reiner, featured groundbreaking musical acts like the Beatles and the Who, and served as a cultural touchstone for the antiwar movement of the late 1960s. Drawing on extensive original interviews with Tom and Dick Smothers and dozens of other key players -- as well as more than a decade's worth of original research -- Dangerously Funny brings readers behind the scenes for all the battles over censorship, mind-blowing musical performances, and unforgettable sketches that defined the show and its era. David Bianculli delves deep into this never-told story, to find out what really happened and to reveal why this show remains so significant to this day.","pageCount":400,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=-aS_vD_lYwEC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=-aS_vD_lYwEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":4,"stars":3,"city":"Quito","type":"Digital"},{"title":"Getaway Funny Signs","authors":["Don Pinnock","Khumo Ntoane"],"publishedDate":"2009-09-01","maturityRating":"NOT_MATURE","description":"Showcasing a bevy of ridiculous, poignant, and often confounding street signs, this entertaining tribute to the images submitted by the globetrotting fans of travel stalwart Getaway over the years is the third eyebrow-raising journey into international public oddity. With a lighthearted focus on the unintentional misuse and abuse of words, this world tour of grammatical incorrectness is a spirited yet good-natured mocking of naivety or ignorance of the English language. Replete with amusing and bewildering photographs from savvy world travelers, and equally targeting the full international spectrum of cultural literary misadventures, this comical collection illustrates how so many exert considerable effort to tell others wacky things on boards and signs—while often getting the message hilariously wrong in the process.","pageCount":88,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=qD4OJUnMu5YC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=qD4OJUnMu5YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":2,"city":"Quito","type":"Hardcover"},{"title":"Funny & Fabulous Fraction Stories","authors":["Dan Greenberg","Jared Lee"],"publishedDate":"1996","maturityRating":"NOT_MATURE","description":"Offers thirty ready-to-reproduce practice pages on such topics as comparing fractions, equivalent fractions, and adding and subtracting fractions.","pageCount":88,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=oqbBmrMFQ6IC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=oqbBmrMFQ6IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":1,"city":"Medellin","type":"Digital"},{"title":"What's So Funny About Education?","authors":["Lou Fournier"],"publishedDate":"2003-05-20","maturityRating":"NOT_MATURE","description":"Using affectionate humor, Fournier delivers both stark and subtle epiphanies alongside enduring truths, offering a deeper social commentary on the present conditions and future directions of American education.","pageCount":108,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=6nHxARbpmQsC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=6nHxARbpmQsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":3,"city":"Cartagena","type":"Hardcover"},{"title":"The Women Who Made Television Funny","authors":["David C. Tucker"],"publishedDate":"2015-03-26","maturityRating":"NOT_MATURE","description":"Most of the bright and talented actresses who made America laugh in the 1950s are off the air today, but their pioneering Hollywood careers irrevocably changed the face of television comedy. These smart and sassy women successfully negotiated the hazards of the male-dominated workplace with class and humor, and the work they did in the 1950s is inventive still by today’s standards. Unable to fall back on strong language, shock value, or racial and sexual epithets, the female sitcom stars of the 1950s entertained with pure talent and screen savvy. As they did so, they helped to lay the foundation for the development of television comedy. This book pays tribute to 10 prominent television actresses who played lead roles in popular comedy shows of the 1950s. Each chapter covers the works and personalities of one actress: Lucille Ball (I Love Lucy), Gracie Allen (The George Burns and Gracie Allen Show), Eve Arden (Our Miss Brooks), Spring Byington (December Bride), Joan Davis (I Married Joan), Anne Jeffreys (Topper), Donna Reed (The Donna Reed Show), Ann Sothern (Private Secretary and The Ann Sothern Show), Gale Storm (My Little Margie and The Gale Storm Show: Oh! Susanna), and Betty White (Life with Elizabeth). For each star, a career sketch is provided, concentrating primarily on her television work but also noting achievements in other areas. Appendices offer cast and crew lists, a chronology, and an additional biographical sketch of 10 less familiar actresses who deserve recognition.","pageCount":215,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=1kKCs1QNkSsC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=1kKCs1QNkSsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":2,"city":"Medellin","type":"Digital"},{"title":"Humor Can Be Funny","authors":["Sam Henderson"],"publishedDate":"2013-06-11","maturityRating":"NOT_MATURE","description":"Sam Henderson's seminal 'laugh-yourself-to-death early minicomics and self-published Magic Whistle digest comic are all collected under one cover.","pageCount":130,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Yu8_CQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Yu8_CQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":1,"city":"Quito","type":"Digital"},{"title":"A Funny Thing Happened on the Way to the White House","authors":["David E. Johnson","Johnny Ray Johnson"],"publishedDate":"2004","maturityRating":"NOT_MATURE","description":"Recounts humorous anecdotes concerning the political campaigns and elections of American presidents ranging from Andrew Jackson to George W. Bush.","pageCount":247,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=T9iQPsfFGgMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=T9iQPsfFGgMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":4,"city":"Cartagena","type":"Hardcover"},{"title":"Funny Business","authors":["Michael Dolan"],"publishedDate":"2013-02-21","maturityRating":"NOT_MATURE","description":"Hey, lighten up! And help your customers and co-workers have a little fun too. There's nothing like Funny Business available anywhere (that's why we wrote it). Find out how to put humor in your writing - and get away with it! Memos, letters, social media - make it all a little funnier. Here's just some of what you'll get: - The Basics of a Working Joke - Why Humor is a Good Idea at Work - The secret to puns - Science Discovers Keys to Humor - Business Jokes","pageCount":75,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Yf0jvjHKIrkC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Yf0jvjHKIrkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":5,"city":"Quito","type":"Digital"},{"title":"Funny Money","authors":["Mark Singer"],"publishedDate":"2004-06","maturityRating":"NOT_MATURE","description":"The New Yorker writer chronicles the collapse of a shopping mall in 1982 that sent reverberations through the banking industry, with fault lines stretching deep into the heart of America's speculative and often soft financial institutions. Reprint.","pageCount":229,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Tsuem0VnaTwC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Tsuem0VnaTwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":5,"city":"Medellin","type":"Hardcover"},{"title":"Be FUNNY or DIE","authors":["Gabriel Angelo"],"publishedDate":"2014-08-19","maturityRating":"NOT_MATURE","description":"TO: The one reading this now wanting to be FUNNY, who is NOT, or is already, but wants to be MORE funny... Howdy! Hey you! Yeah...YOU! Why are you even here reading this wanting to be funny? Ah, let me guess... * Is it to impress the hot ladies or cute guys, hoping to get into her panties or his tidy-whities? * Is it to get along with your boss, colleagues, families, or whoever the heck is in your life? * Is it to make people like you and have more friends because you have nada? * Is it to advance your professional life to have all the fancy cars, big house, and shoes (ladies)? * Is it to have a freaking awesome social life to be Mr. or Ms. Congeniality? Now listen up for I got a funny bone to pick with you. Let me let you in on a little secret. Being funny is not a talent you are born with, in fact, anybody can be mad funny, even if they're not (especially if they're not). You know deep down, you know that already or else, why would you be interested in \"learning\" how to be funny. Still don't believe you can be damn funny? Fine, you left me no choice... Let's put it this way, what if somebody were to put a pistol to your head and said, \"Be funny, or die!\" You would force yourself to be ridiculously damn funny like you never thought possible! That's what \"Be FUNNY or DIE\" will do, make you ridiculously damn funny. Just have a look at how funny you can be: * How to spice up any of your interaction with \"funny recipes\" to be a comical conversationalist (talking muy caliente) to get people laughing their tails off? * How to be master of the witty one-liners, that you can pull out of thin air and have people impress by such talented creative-wit of yours (haha good one)? * How to be spontaneous always have the right things to say to generate a laugh, or get out of troublesome sticky situations (\"uh-oh, oh-no\" but fear not)? * How to create and tell your funny jokes the right way, so you always over deliver the goods and won't fall flat on your tooshie (ouch! that's gonna gotta hurt)? * How to craft and come up with your own hilarious stories to tell whenever and wherever you want, to get people falling for you (marry me please!)? * How to actually be funny rather than just saying something funny, and the different comical character archetypes that you can emulate to be funny (laughing with you, not at you)? * How to incorporate humor into your everyday life, and have a lifestyle always comprising of humor and good laughters (you're so funny)? ...and that's only just a tip on the bird's nest. There's many more goodies in stored for you on the other side. Well? What you waiting for? Do you want to be funny or not? Don't make me force you. Be funny, or die! The choice is yours.","pageCount":145,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=ERQ9BQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=ERQ9BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":3,"stars":4,"city":"Cartagena","type":"Digital"},{"title":"Ball & Other Funny Stories About Cancer","authors":["Brian Lobel"],"publishedDate":"2012-06-18","maturityRating":"NOT_MATURE","description":"Unexpected, quirky and provocative, BALL & Other Funny Stories About Cancer is a unique collection of performances about illness and the changing body over time. Documenting a trilogy of Brian Lobel’s monologue performances from 2001-2011, this collection challenges the inspirational stories of survivors and martyrs that have come before, infusing the ‘cancer story’ with an urgency and humour which is sometimes inappropriate, often salacious and always, above all else, honest and open. Published together for the first time, this collection of performances goes beyond the chemotherapy to include reflections on politics, sexuality and gender, providing cancer – and cancer narratives – with a much-deserved kick in the ball(s).","pageCount":64,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=QvPKWKZFWFwC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=QvPKWKZFWFwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":3,"city":"Quito","type":"Hardcover"},{"title":"Pretty/Funny","authors":["Linda Mizejewski"],"publishedDate":"2014-03-07","maturityRating":"NOT_MATURE","description":"Women in comedy have traditionally been pegged as either \"pretty\" or \"funny.\" Attractive actresses with good comic timing such as Katherine Hepburn, Lucille Ball, and Julia Roberts have always gotten plum roles as the heroines of romantic comedies and television sitcoms. But fewer women who write and perform their own comedy have become stars, and, most often, they've been successful because they were willing to be funny-looking, from Fanny Brice and Phyllis Diller to Lily Tomlin and Carol Burnett. In this pretty-versus-funny history, women writer-comedians—no matter what they look like—have ended up on the other side of \"pretty,\" enabling them to make it the topic and butt of the joke, the ideal that is exposed as funny. Pretty/Funny focuses on Kathy Griffin, Tina Fey, Sarah Silverman, Margaret Cho, Wanda Sykes, and Ellen DeGeneres, the groundbreaking women comics who flout the pretty-versus-funny dynamic by targeting glamour, postfeminist girliness, the Hollywood A-list, and feminine whiteness with their wit and biting satire. Linda Mizejewski demonstrates that while these comics don't all identify as feminists or take politically correct positions, their work on gender, sexuality, and race has a political impact. The first major study of women and humor in twenty years, Pretty/Funny makes a convincing case that women's comedy has become a prime site for feminism to speak, talk back, and be contested in the twenty-first century.","pageCount":278,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=AJAQAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=AJAQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":2,"city":"Medellin","type":"Digital"},{"title":"The Adventures of Funny Bunny the Brown Bunny","authors":["J. L. Nathan"],"publishedDate":"2008-06","maturityRating":"NOT_MATURE","description":"Jade Nathan has made a concerted effort to study the personalities of children, their interaction with each other, as well as with adults. In doing so she has realized that every child struggles with who they are, and how they feel about themselves. Ms. Nathans series of childrens books tactfully and yet humorously discusses issues regarding self-esteem, self-respect, and the ultimate respect for others. The stories are masterfully written, and will appeal to parents and children from all backgrounds. The characters are lovable. They will not only teach valuable lessons, but will touch the heart.","pageCount":32,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=-3wNel8kEroC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=-3wNel8kEroC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},"averageRating":0,"stars":1,"city":"Cartagena","type":"Hardcover"}]